/* Details of a saved card. &apos;{card brand} ending in {last 4}&apos; e.g. &apos;VISA ending in 4242&apos; */
"%1$@ ending in %2$@" = "%1$@ li jispiċċa %2$@";

/* Bank name when bank is offline for maintenance. */
"%@ - Offline" = "%@- Offline";

/* Text for a button that, when tapped, displays another screen where the customer can add payment method details */
"+ Add" = "+ Żid";

/* Text for a button that, when tapped, displays another screen where the customer can enter card details */
"+ Add card" = "+ Żid kard";

/* Source type brand name */
"3D Secure" = "3D Secure";

/* Title for address entry section */
"ACCOUNT HOLDER ADDRESS" = "INDIRIZZ TAD-DETENTUR TAL-KONT";

/* This is a Payment Method type brand name so shouldn&apos;t be translated unless it has a different name in a given localization. */
"AU BECS Debit" = "Debitu  AU BECS";

/* part of {Account} ending in {last4} */
"Account" = "Kont";

/* Caption for Name field on bank info form */
"Account Holder Name" = "Isem id-Detentur tal-Kont";

/* Placeholder text for Account number entry field for BECS Debit. */
"Account number" = "In-numru tal-kont";

/* Button to add a new credit card. */
"Add New Card…" = "Żid Kard Ġdida…";

/* Title for Add a Card view */
"Add a Card" = "Żid Kard";

/* Title for SEPA Debit Account form */
"Add a Direct Debit Account" = "Żid Kont tad-Debitu Dirett";

/* Title shown above a card entry form */
"Add a card" = "Żid kard";

/* Label of a button displayed below a card entry form that saves the card details */
"Add card" = "Żid kard";

/* Text for a button that, when tapped, displays another screen where the customer can add payment method details */
"Add new payment method" = "Żid metodu tal-ħlas ġdid";

/* Title shown above a form where the customer can enter payment information like credit card details, email, billing address, etc. */
"Add your payment information" = "Żid l-informazzjoni dwar il-pagament tiegħek";

/* Address line 2 placeholder for billing address form. */
"Address line 2 (optional)" = "Indirizz linja 2 (mhux obbligatorju)";

/* Payment Method type brand name  */
"Afterpay" = "Afterpay";

/* Payment Method type brand name */
"AfterpayClearpay" = "AfterpayClearpay";

/* Payment Method type brand name */
"AfterpayClearpay_copy" = "AfterpayClearpay";

/* Source type brand name */
"Alipay" = "Alipay";

/* Text for Apple Pay payment method */
"Apple Pay" = "Apple Pay";

/* Caption for Apartment/Address line 2 field on address form */
"Apt." = "Appartament";

/* Title for bank picker section */
"BANK" = "BANK";

/* Title for bank account information form */
"BANK ACCOUNT INFORMATION" = "INFORMAZZJONI TAL-KONT BANKARJU";

/* Title for billing address entry section */
"BILLING ADDRESS" = "INDIRIZZ TAL-KONT";

/* Payment Method type brand name */
"BLIK" = "BLIK";

/* Placeholder text for BSB Number entry field for BECS Debit. */
"BSB" = "BSB";

/* Text for back button */
"Back" = "Lura";

/* Source type brand name */
"Bancontact" = "Bancontact";

/* Label for Bank Account selection or detail entry form */
"Bank Account" = "Kont bankarju";

/* Title for billing address entry section */
"Billing Address" = "Indirizz tal-Kont";

/* Billing address section title for card form entry. */
"Billing address" = "Indirizz tal-kont";

/* Payment Method type brand name */
"Boleto" = "Boleto";

/* Klarna buy now or pay later copy */
"Buy now or pay later with Klarna." = "Ixtri issa jew ħallas iktar tard bil-Klarna.";

/* SEPA legal authorization text – must use official translations. */
"By providing your IBAN and confirming this payment, you are authorizing %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and your bank to debit your account in accordance with those instructions. You are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited." = "Meta tipprovdi l-IBAN tiegħek u tikkonferma dan il-pagament, inti tawtorizza lil %@ u Stripe, il-fornitur tas-servizz tal-pagamenti tagħna, biex jibagħtu istruzzjonijiet lill-bank tiegħek biex jiddebita l-kont tiegħek u l-bank tiegħek biex jiddebita l-kont tiegħek skont dawk l-istruzzjonijiet. Inti intitolat għal rifużjoni mill-bank tiegħek skont it-termini u l-kundizzjonijiet tal-ftehim tiegħek mal-bank tiegħek. Rifużjoni trid tintalab fi żmien 8 ġimgħat li jibdew mid-data li fiha kien iddebitat il-kont tiegħek.";

/* SEPA mandate text */
"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Meta tagħti l-informazzjoni tal-pagament tiegħek u tikkonferma dan il-pagament, tkun qed tawtorizza lil (A) %@ u lil Stripe, l-operatur tas-servizz tal-pagamenti tagħna, biex jibagħtu struzzjonijiet lill-bank tiegħek biex jieħu l-fondi mill-kont tiegħek u (B) lill-bank tiegħek biex jieħu l-fondi mill-kont tiegħek skont dawn l-istruzzjonijiet. Bħala parti mid-drittijiet tiegħek, inti għandek dritt għall-ħlas lura mill-bank tiegħek skont it-termini u l-kundizzjonijiet tal-ftehim tiegħek mal-bank tiegħek. Ħlas lura għandu jintalab fi żmien 8 ġimgħat, li jibdew jgħoddu mid-data li fiha l-fondi jittieħdu mill-kont tiegħek. Id-drittijiet tiegħek huma spjegati f'dikjarazzjoni li tista' tikseb mingħand il-bank tiegħek. Inti taqbel li, sa jumejn qabel, tirċievi notifika kull darba li l-fondi jkunu se jittieħdu mill-kont tiegħek.";

/* Title for card number entry field */
"CARD" = "KARD";

/* Title for contact info form */
"CONTACT" = "KUNTATT";

/* Title for country picker section */
"COUNTRY" = "PAJJIŻ";

/* Label for entering CVC in text field */
"CVC" = "CVC";

/* Label for entering CVV in text field */
"CVV" = "CVV";

/* Button title to cancel action in an alert */
"Cancel" = "Ikkanċella";

/* Title for credit card number entry field */
"Card" = "Kard";

/* Details of a saved card */
"Card ending in %@" = "Il-kard li tispiċċa %@";

/* Card details entry form header title */
"Card information" = "L-informazzjoni tal-kard";

/* Label for card number entry text field */
"Card number" = "In-numru tal-kard";

/* TODO */
"Choose a payment method" = "Agħżel metodu tal-ħlas";

/* Payment Method type brand name */
"Clearpay" = "Clearpay";

/* Accessibility label for the button to close the card scanner. */
"Close card scanner" = "Agħlaq l-iskenner tal-kard";

/* Title for contact info form */
"Contact" = "Kuntatt";

/* Text for continue button */
"Continue" = "Kompli";

/* Title for delivery address entry section */
"DELIVERY ADDRESS" = "INDIRIZZ TAL-KUNSINNA";

/* Title for delivery info form */
"Delivery" = "Kunsinna";

/* Title for delivery address entry section */
"Delivery Address" = "Indirizz tal-Kunsinna";

/* Source type brand name */
"EPS" = "EPS";

/* Button title to enter editing mode */
"Edit" = "Editja";

/* Payment Method type brand name */
"FPX" = "FPX";

/* Label for free shipping method */
"Free" = "Bla ħlas";

/* Placeholder string for name entry field. */
"Full name" = "Isem sħiħ";

/* Source type brand name */
"Giropay" = "Giropay";

/* Payment Method type brand name. */
"GrabPay" = "GrabPay";

/* IBAN placeholder – don&apos;t translate */
"IBAN" = "IBAN";

/* Shipping form error message */
"Invalid Shipping Address" = "L-Indirizz għat-Trasport tal-Merkanzija Mhux Validu";

/* Spoken during VoiceOver when a form field has failed validation. */
"Invalid data." = "Data invalida.";

/* Source type brand name */
"Klarna" = "Klarna";

/* Link Payment Method type brand name */
"Link" = "Link";

/* Title for screen when data is still loading from the network. */
"Loading…" = "Qed jillowdja…";

/* label for text field to enter card expiry */
"MM / YY" = "XX / SS";

/* label for text field to enter card expiry */
"MM/YY" = "XX/SS";

/* Title for payment options section */
"MORE OPTIONS" = "AKTAR GĦAŻLIET";

/* Source type brand name */
"Multibanco" = "Multibanco";

/* Payment Method type brand name */
"NetBanking" = "NetBanking";

/* Label for button to add a new credit or debit card */
"New Card" = "Kard Ġdida";

/* Label for button to add a new SEPA Direct Debit account */
"New Direct Debit Account" = "Kont Ġdid tad-Debitu Dirett";

/* Accessibility label for button to add a new SEPA Direct Debit account */
"New SEPA Direct Debit Account" = "Kont Ġdid tad-Debitu Dirett SEPA";

/* Button to move to the next text entry field */
"Next" = "Li jmiss";

/* No comment provided by engineer. */
"OK" = "Tajjeb";

/* Payment Method type brand name */
"OXXO" = "OXXO";

/* Button to pay with a Bank Account (using FPX). */
"Online Banking (FPX)" = "Bankar online";

/* Title of a section containing multiple payment methods that can selected and will collect the payment information from the user. */
"Or pay using" = "Jew ħallas bil-";

/* Title of a section containing a card form that will collect the payment information from the user. */
"Or pay with a card" = "Jew ħallas bil-kard";

/* An option in a dropdown selector indicating the customer's desired selection is not in the list. e.g., 'Choose your bank: Bank1, Bank2, Other' */
"Other" = "Oħrajn";

/* Source type brand name */
"P24" = "P24";

/* Label of a button that initiates payment when tapped */
"Pay %@" = "Ħallas %@";

/* Klarna pay later copy */
"Pay later with Klarna." = "Ħlas aktar tard bil-Klarna.";

/* Pay with {payment method} */
"Pay with %@" = "Ħallas b' %@";

/* Payment Method type brand name */
"PayPal" = "PayPal";

/* Title for Payment Method screen */
"Payment Method" = "Metodu tal-Ħlas";

/* Caption for Phone field on address form */
"Phone" = "Telefon";

/* Accessibility instructions for card scanning. */
"Point the camera at your card." = "Dawwar il-kamera lejn il-kard tiegħek.";

/* Short string for postal code (text used in non-US countries). Please keep to 8 characters or less if possible. */
"Postal" = "Postali";

/* Caption for Postal Code field on address form (only shown in countries other than the United States) */
"Postal Code" = "Kodiċi Postali";

/* Label of a button that, when tapped, initiates payment, becomes disabled, and displays this text */
"Processing..." = "Qed jiġi pproċessat...";

/* Payment Method type brand name. */
"Przelewy24" = "Przelewy24";

/* Button title for confirmation alert to remove a saved payment method
   Text for remove button */

"Remove" = "Neħħi";
/* Content for alert popup prompting to confirm removing a saved card. Remove {card brand} ending in {last 4} e.g. &apos;Remove VISA ending in 4242&apos; */

"Remove %1$@ ending in %2$@" = "Neħħi %1$@ li jispiċċa %2$@";
/* Content for alert popup prompting to confirm removing saved payment method. */

"Remove %@" = "Neħħi %@";
/* Title for confirmation alert to remove a card */

"Remove Card" = "Neħħi Kard";
/* Title for confirmation alert to remove a saved bank account payment method */

"Remove bank account" = "Neħħi l-kont tal-bank";
/* Content for alert popup prompting to confirm removing a saved bank account. e.g. 'Remove bank account ending in 4242' */

"Remove bank account ending in %@" = "Neħħi l-kont tal-bank li jispiċċa b'%@";
/* part of {SEPA Account} ending in {last4} */

"SEPA Account" = "Kont SEPA";
/* Payment method brand name */

"SEPA Debit" = "Debitu SEPA";
/* Source type brand name */

"SEPA Direct Debit" = "Debitu Dirett SEPA";
/* Title for shipping address entry section */

"SHIPPING ADDRESS" = "L-INDIRIZZ TAT-TRASPORT TAL-MERKANZIJA";
/* Label for shipping method form */

"SHIPPING METHOD" = "IL-MOD TAT-TRASPORT TAL-MERKANZIJA";
/* Source type brand name */

"SOFORT" = "SOFORT";
/* The label of a switch indicating whether to save the payment method for future payments. */

"Save for future payments" = "Erfa' għall-pagamenti fil-ġejjieni";
/* The label of a switch indicating whether to save the user&apos;s card for future payments to this merchant */

"Save this card for future %@ payments" = "Erfa' din il-kard għal pagamenti futuri %@";
/* The label of a switch indicating whether to save the user's card for future payment */

"Save this card for future Stripe payments" = "Erfa' din il-kard għal pagamenti futuri lil Stripe";
/* Label of a button displayed below a payment method form. Tapping the button closes the form and uses the entered payment method details for checkout in the next step */

"Select" = "Agħżel";
/* label for iDEAL-bank selection picker */

"Select bank" = "Agħżel bank";
/* Title shown above a carousel containing the customer&apos;s payment methods */

"Select your payment method" = "Agħżel il-metodu tal-ħlas tiegħek";
/* Label of a button displayed below a payment method form. Tapping the button sets the payment method up for future use */

"Set up" = "Stabilixxi";
/* Title for shipping info form */

"Shipping" = "Trasport tal-Merkanzija";
/* Title for shipping address entry section */

"Shipping Address" = "L-Indirizz tat-Trasport tal-Merkanzija";
/* Label for shipping method form */

"Shipping Method" = "Il-Mod tat-Trasport tal-Merkanzija";
/* Payment Method type brand name

   Source type brand name */
"Sofort" = "Sofort";

/* Caption for generalized state/province/region field on address form (not tied to a specific country&apos;s format) */
"State / Province / Region" = "Stat / Provinċja / Reġjun";

/* Error string displayed to user when they have entered an incomplete BSB number. BSB refers to an Australian bank account number */
"The BSB you entered is incomplete." = "Il-BSB li daħħalt mhux komplut.";

/* Error string displayed to user when they enter in an invalid BSB number. &quot;BSB&quot; refers to an Australian bank account. */
"The BSB you entered is invalid." = "Il-BSB li daħħalt mhux validu.";

/* An error message displayed when the customer's IBAN is incomplete. */
"The IBAN you entered is incomplete." = "L-IBAN li daħħalt mhux komplut.";

/* An error message displayed when the IBAN country code is not supported. */
"The IBAN you entered is invalid, \"%@\" is not a supported country code." = "L-IBAN li daħħalt mhux tajjeb, \"%@\" mhux pajjiż li jista' jintuża.";

/* Error when the seleted payment method is not available (eg attempted to use 3D Secure on a card that does not support it). */
"The selected payment method is not available." = "Il-metodu tal-ħlas magħżul mhuwiex disponibbli.";

/* Error when 3DS2 authentication timed out. */
"Timed out authenticating your payment method -- try again" = "Skada l-ħin tal-awtentikazzjoni tal-metodu tal-ħlas tiegħek -- erġa' pprova";

/* Error when the user hasn&apos;t allowed the current app to access the camera when scanning a payment card. &apos;Settings&apos; is the localized name of the iOS Settings app. */
"To scan your card, allow camera access in Settings." = "Biex tiskennja l-kard tiegħek, ippermetti l-aċċess tal-kamera fis-Settings.";

/* Payment Method type brand name */
"UPI" = "UPI";

/* Default missing source type label */
"Unknown" = "Mhux magħruf";

/* Button to fill shipping address from billing address. */
"Use Billing" = "Uża tal-Kont";

/* Button to fill billing address from delivery address. */
"Use Delivery" = "Uża tal-Kunsinna";

/* Button to fill billing address from shipping address. */
"Use Shipping" = "Uża tat-Trasport tal-Merkanzija";

/* Error when 3DS2 authentication failed (e.g. customer entered the wrong code) */
"We are unable to authenticate your payment method. Please choose a different payment method and try again." = "Ma nistgħux nawtentikaw il-metodu tal-ħlas tiegħek. Jekk jogħġbok agħżel metodu tal-ħlas differenti u erġa' pprova.";

/* Source type brand name */
"WeChat Pay" = "WeChat Pay";

/* You&apos;ll be taken to {bank name} to finish your purchase. */
"You'll be taken to %@ to finish your purchase." = "Inti se tittieħed għand %@ biex tlesti x-xiri tiegħek.";

/* An error message displayed when the IBAN does not start with a two-letter country code. */
"Your IBAN should start with a two-letter country code." = "L-IBAN tiegħek għandu jibda b'kodiċi tal-pajjiż magħmul minn żewġ ittri.";

/* An error message. */
"Your IBAN should start with a two-letter country code._copy" = "L-IBAN tiegħek għandu jibda b'kodiċi tal-pajjiż magħmul minn żewġ ittri.";

/* Error message for when ZIP code in form is incomplete (US only) */
"Your ZIP is incomplete." = "Il-kodiċi postali tiegħek mhux komplut.";

/* Error message for when postal code in form is invalid (US only) */
"Your ZIP is invalid." = "Il-kodiċi postali tiegħek mhux validu.";

/* Error message for card form when card number is incomplete */
"Your card number is incomplete." = "In-numru tal-kard tiegħek mhux komplut.";

/* Error message for card form when card number is invalid */
"Your card number is invalid." = "In-numru tal-kard tiegħek mhux validu.";

/* Error message for card details form when expiration date isn&apos;t entered completely */
"Your card's expiration date is incomplete." = "Id-data tal-iskadenza tal-kard tiegħek mhijiex kompluta.";

/* Error message for card details form when expiration date is invalid */
"Your card's expiration date is invalid." = "Id-data tal-iskadenza tal-kard tiegħek mhijiex valida.";

/* String to describe an invalid month in expiry date. */
"Your card's expiration month is invalid." = "Ix-xahar tal-iskadenza tal-kard tiegħek mhux validu.";

/* String to describe an invalid year in expiry date. */
"Your card's expiration year is invalid." = "Is-sena tal-iskadenza tal-kard tiegħek mhijiex valida.";

/* Error message for card entry form when CVC/CVV is incomplete. */
"Your card's security code is incomplete." = "Il-kodiċi tas-sigurtà tal-kard tiegħek mhux komplut.";

/* Error message for card entry form when CVC/CVV is invalid */
"Your card's security code is invalid." = "Il-kodiċi tas-sigurtà tal-kard tiegħek mhux validu.";

/* Error message for when postal code in form is incomplete */
"Your postal code is incomplete." = "Il-kodiċi postali tiegħek mhux komplut.";

/* Error message for when postal code in form is invalid */
"Your postal code is invalid." = "Il-kodiċi postali tiegħek mhux validu.";

/* Caption for Zip Code field on address form (only shown when country is United States only) */
"ZIP Code" = "Kodiċi Postali";

/* accessibility label for text field */
"card number" = "in-numru tal-kard";

/* Placeholder string for email entry field. */
"example@example.com" = "eżempju@eżempju.com";

/* accessibility label for text field */
"expiration date" = "id-data tal-iskadenza";

/* Payment Method type brand name. */
"giropay" = "Giropay";

/* Source type brand name */
"iDEAL" = "iDEAL";

/* iDEAL bank section title for iDEAL form entry. */
"iDEAL Bank" = "Il-Bank iDEAL";

